//Знайти з неперервних послідовностей від’ємних чисел ту послідовність, яка має найбільше абсолютне значення середнього арифметичного її значення.
//Розмірність масиву 100
//Діапазон значень -50, 50

#include <iostream>

using namespace std;

int main()
{
   int array[100];
   int j=0;
   int i =-50;

   cout << endl;

   cout << "Початковий масив: ";
   while (j<101)
   {
    array[j] = i;
    cout << array[j] << " ";
    i++;
    j++;
   }
   cout << endl;
   cout << endl;
   cout << "Послідовність яка має найбільше абсолютне значення середнього арифметичного її значення: " << endl;
   



}